In [ ]:
#3개의 ranking system 중 상위 10% 추출 후 paired t test

In [1]:
import os
import pandas as pd
import numpy as np

os.chdir("C:/Users/user/stats")

['.ipynb_checkpoints',
 '3개의 순위 중 상위 10% 추출 후 paired t test.ipynb',
 'back',
 'cwur data 데이터처리.ipynb',
 'cwur_final.xlsx',
 'shanghai data 데이터전처리 분석.ipynb',
 'times_final.xlsx',
 'times_데이터전처리_분석.ipynb',
 '논문 디자인.txt',
 '할일.txt']

# times에서 상위 10위가 cwur에서는?

+ California Institute of Technology , Imperial College London	두 학교가 times에서는 상위였지만 cwur에서 상대적으로 낮은 순위로 평가됨

In [22]:
times = pd.read_excel("times_final.xlsx")
cwur  = pd.read_excel("cwur_final.xlsx")

### YEAR 2012

In [17]:
times2012_top10 = times[times['year'] == 2012].head(10)
times2012_top10

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
0,1,California Institute of Technology,United States of America,95.7,56.0,98.2,99.9,97.0000,94.8,2243.0,6.9,0.27,0.330000,2012
1,2,Harvard University,United States of America,95.8,67.5,97.4,99.8,35.9000,93.9,20152.0,8.9,0.25,1.358437,2012
2,2,Stanford University,United States of America,94.8,57.2,98.9,99.8,63.8000,93.9,15596.0,7.8,0.22,0.420000,2012
3,4,University of Oxford,United Kingdom,89.5,91.9,96.6,97.9,62.1000,93.6,19919.0,11.6,0.34,0.460000,2012
4,5,Princeton University,United States of America,91.5,49.6,99.1,100.0,81.0000,92.9,7929.0,8.4,0.27,0.450000,2012
5,6,University of Cambridge,United Kingdom,90.5,85.3,94.2,97.3,55.5000,92.4,18812.0,11.8,0.34,0.460000,2012
6,7,Massachusetts Institute of Technology,United States of America,92.7,79.2,87.4,100.0,94.4000,92.3,11074.0,9.0,0.33,0.370000,2012
7,8,Imperial College London,United Kingdom,88.8,92.2,88.7,93.9,93.1000,90.7,15060.0,11.7,0.51,0.370000,2012
8,9,University of Chicago,United States of America,89.4,58.8,90.8,99.4,90.1189,90.2,14221.0,6.9,0.21,0.420000,2012
9,10,"University of California, Berkeley",United States of America,82.8,50.4,99.4,99.4,62.5000,89.8,36186.0,16.4,0.15,0.500000,2012

In [16]:
# 이름 같은지 확인
set(times2012_top10['university_name']) & set(cwur.loc[cwur['year'] == 2012,'institution'].values)

{'California Institute of Technology',
 'Harvard University',
 'Imperial College London',
 'Massachusetts Institute of Technology',
 'Princeton University',
 'Stanford University',
 'University of California, Berkeley',
 'University of Cambridge',
 'University of Chicago',
 'University of Oxford'}

In [26]:
tmp1 = times2012_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = cwur[cwur['year']==2012][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
                                                 "institution":"university_name"})

In [28]:
tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                        university_name  cwur_world_rank
0                 1     California Institute of Technology                5
1                 2                     Harvard University                1
2                 2                    Stanford University                3
3                 4                   University of Oxford                7
4                 5                   Princeton University                6
5                 6                University of Cambridge                4
6                 7  Massachusetts Institute of Technology                2
7                 8                Imperial College London               28
8                 9                  University of Chicago               11
9                10     University of California, Berkeley               10

In [30]:
# paired t test 
# pvalue=0.3081이므로 유의하게 차이가 있지않지만 
# 위의 값을 보면 Imperial College London이 times에서는 8위이지만 
# cwur에서 28위로 크게 차이가 있는것으로 보여진다.
from scipy.stats import ttest_rel
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=-1.0801045444785358, pvalue=0.3081885290295448)

In [33]:
# cwur에서 Imperial College London 확인
cwur[(cwur['year']==2012) &  (cwur['institution'] == "Imperial College London")]

,world_rank,institution,country,national_rank,quality_of_education,alumni_employment,quality_of_faculty,publications,influence,citations,broad_impact,patents,score,year
27,28,Imperial College London,United Kingdom,3,84,73,35,26,26,29,NaN,41,57.53,2012

### YEAR 2013

In [34]:
times2013_top10 = times[times['year'] == 2013].head(10)
times2013_top10

,world_rank,university_name,country,teaching,international,research,citations,income,total_score,num_students,student_staff_ratio,international_students,female_male_ratio,year
402,1,California Institute of Technology,United States of America,96.3,59.8,99.4,99.7,95.600000,95.5,2243.0,6.9,0.27,0.330000,2013
403,2,Stanford University,United States of America,95.0,56.6,98.8,99.3,62.400000,93.7,15596.0,7.8,0.22,0.420000,2013
404,2,University of Oxford,United Kingdom,89.7,88.7,98.1,95.6,79.800000,93.7,19919.0,11.6,0.34,0.460000,2013
405,4,Harvard University,United States of America,94.9,63.7,98.6,99.2,39.900000,93.6,20152.0,8.9,0.25,1.251757,2013
406,5,Massachusetts Institute of Technology,United States of America,92.9,81.6,89.2,99.9,92.900000,93.1,11074.0,9.0,0.33,0.370000,2013
407,6,Princeton University,United States of America,89.5,54.5,99.4,99.8,79.500000,92.7,7929.0,8.4,0.27,0.450000,2013
408,7,University of Cambridge,United Kingdom,91.2,83.6,95.6,96.2,59.100000,92.6,18812.0,11.8,0.34,0.460000,2013
409,8,Imperial College London,United Kingdom,88.0,91.4,90.9,93.0,87.500000,90.6,15060.0,11.7,0.51,0.370000,2013
410,9,"University of California, Berkeley",United States of America,85.1,49.7,99.3,99.3,65.400000,90.5,36186.0,16.4,0.15,0.500000,2013
411,10,University of Chicago,United States of America,89.6,55.3,92.9,98.7,90.924313,90.4,14221.0,6.9,0.21,0.420000,2013

In [37]:
tmp1 = times2013_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = cwur[cwur['year']==2013][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
                                                 "institution":"university_name"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                        university_name  cwur_world_rank
0                 1     California Institute of Technology               11
1                 2                    Stanford University                2
2                 2                   University of Oxford                3
3                 4                     Harvard University                1
4                 5  Massachusetts Institute of Technology                4
5                 6                   Princeton University                8
6                 7                University of Cambridge                5
7                 8                Imperial College London               27
8                 9     University of California, Berkeley                7
9                10                  University of Chicago                9

In [39]:
# 2012와 동일 pvalue=0.3212
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=-1.0496800848309102, pvalue=0.3212333557249617)

### YEAR 2014

In [41]:
times2014_top10 = times[times['year'] == 2014].head(10)
times2014_top10


tmp1 = times2014_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = cwur[cwur['year']==2014][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                        university_name  cwur_world_rank
0                 1     California Institute of Technology               12
1                 2                     Harvard University                1
2                 2                   University of Oxford                5
3                 4                    Stanford University                2
4                 5  Massachusetts Institute of Technology                3
5                 6                   Princeton University                9
6                 7                University of Cambridge                4
7                 8     University of California, Berkeley                7
8                 9                  University of Chicago                8
9                10                Imperial College London               39

In [42]:
#  2012와 동일 pvalue=0.2768
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=-1.1576154497119346, pvalue=0.27681851390802914)

### YEAR 2015

In [43]:
times2015_top10 = times[times['year'] == 2015].head(10)
times2015_top10


tmp1 = times2015_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = cwur[cwur['year']==2015][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                        university_name  cwur_world_rank
0                 1     California Institute of Technology               12
1                 2                     Harvard University                1
2                 3                   University of Oxford                5
3                 4                    Stanford University                2
4                 5                University of Cambridge                4
5                 6  Massachusetts Institute of Technology                3
6                 7                   Princeton University                9
7                 8     University of California, Berkeley                7
8                 9                Imperial College London               35
9                 9                        Yale University               11

In [45]:
#  2012와 동일 pvalue=0.2418
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=-1.2527549711709767, pvalue=0.24186556147789268)

# times에서 상위 10위가 shanghai에서는?

+ times와 shanghai는 거의 동일

In [46]:
times = pd.read_excel("times_final.xlsx")
shanghai  = pd.read_excel("shanghai_final.xlsx")

### YEAR 2012

In [49]:
times2012_top10 = times[times['year'] == 2012].head(10)

tmp1 = times2012_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = shanghai[shanghai['year']==2012][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                     university_name  shanghai_world_rank
0                 1  California Institute of Technology                    6
1                 2                  Harvard University                    1
2                 2                 Stanford University                    2
3                 4                University of Oxford                   10
4                 5                Princeton University                    7
5                 6             University of Cambridge                    5
6                 9               University of Chicago                    9
7                10  University of California, Berkeley                    4

In [51]:
# 차이 없음 pvalue=0.6540
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=-0.46799976466303467, pvalue=0.654006307161469)

### YEAR 2013

In [52]:
times2013_top10 = times[times['year'] == 2013].head(10)

tmp1 = times2013_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = shanghai[shanghai['year']==2013][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                     university_name  shanghai_world_rank
0                 1  California Institute of Technology                    6
1                 2                 Stanford University                    2
2                 2                University of Oxford                   10
3                 4                  Harvard University                    1
4                 6                Princeton University                    7
5                 7             University of Cambridge                    5
6                 9  University of California, Berkeley                    3
7                10               University of Chicago                    9

In [54]:
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=-0.15839698777049716, pvalue=0.8786167677584014)

### YEAR 2014

In [55]:
times2014_top10 = times[times['year'] == 2014].head(10)

tmp1 = times2014_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = shanghai[shanghai['year']==2014][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                     university_name  shanghai_world_rank
0                 1  California Institute of Technology                    7
1                 2                  Harvard University                    1
2                 2                University of Oxford                    9
3                 4                 Stanford University                    2
4                 6                Princeton University                    6
5                 7             University of Cambridge                    5
6                 9               University of Chicago                    9

In [56]:
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=-0.8040302522073696, pvalue=0.4520503329126979)

### YEAR 2015

In [57]:
times2015_top10 = times[times['year'] == 2015].head(10)

tmp1 = times2015_top10[["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})
tmp2 = shanghai[shanghai['year']==2015][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   times_world_rank                     university_name  shanghai_world_rank
0                 1  California Institute of Technology                    7
1                 2                  Harvard University                    1
2                 3                University of Oxford                   10
3                 4                 Stanford University                    2
4                 5             University of Cambridge                    5
5                 7                Princeton University                    6
6                 8  University of California, Berkeley                    4
7                 9                     Yale University                   11

In [58]:
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=-0.6393903532568366, pvalue=0.542918546503643)

# cwur에서 상위 10위가 times에서는?

+ 유의한 차이 없음

### Year 2012

In [59]:
cwur2012_top10 = cwur[cwur['year'] == 2012].head(10)
cwur2012_top10


tmp1 = cwur2012_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
                                                 "institution":"university_name"})
tmp2 = times[times['year']==2012][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                        university_name  times_world_rank
0                1                     Harvard University                 2
1                2  Massachusetts Institute of Technology                 7
2                3                    Stanford University                 2
3                4                University of Cambridge                 6
4                5     California Institute of Technology                 1
5                6                   Princeton University                 5
6                7                   University of Oxford                 4
7                8                        Yale University                11
8                9                    Columbia University                12
9               10     University of California, Berkeley                10

In [60]:
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=0.5570860145311556, pvalue=0.5910512317836047)

### Year 2013

In [61]:
cwur2013_top10 = cwur[cwur['year'] == 2013].head(10)
cwur2013_top10


tmp1 = cwur2013_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})
tmp2 = times[times['year']==2013][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                        university_name  times_world_rank
0                1                     Harvard University                 4
1                2                    Stanford University                 2
2                3                   University of Oxford                 2
3                4  Massachusetts Institute of Technology                 5
4                5                University of Cambridge                 7
5                6                    Columbia University                14
6                7     University of California, Berkeley                 9
7                8                   Princeton University                 6
8                9                  University of Chicago                10
9               10                        Yale University                11

In [62]:
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=1.745025152241333, pvalue=0.1149396443478832)

### Year 2014

In [63]:
cwur2014_top10 = cwur[cwur['year'] == 2014].head(10)
cwur2014_top10


tmp1 = cwur2014_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})
tmp2 = times[times['year']==2014][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                        university_name  times_world_rank
0                1                     Harvard University                 2
1                2                    Stanford University                 4
2                3  Massachusetts Institute of Technology                 5
3                4                University of Cambridge                 7
4                5                   University of Oxford                 2
5                6                    Columbia University                13
6                7     University of California, Berkeley                 8
7                8                  University of Chicago                 9
8                9                   Princeton University                 6
9               10                        Yale University                11

In [64]:
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=1.326977605394074, pvalue=0.217194922304716)

### Year 2015

In [65]:
cwur2015_top10 = cwur[cwur['year'] == 2015].head(10)
cwur2015_top10


tmp1 = cwur2015_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})
tmp2 = times[times['year']==2015][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                        university_name  times_world_rank
0                1                     Harvard University                 2
1                2                    Stanford University                 4
2                3  Massachusetts Institute of Technology                 6
3                4                University of Cambridge                 5
4                5                   University of Oxford                 3
5                6                    Columbia University                14
6                7     University of California, Berkeley                 8
7                8                  University of Chicago                11
8                9                   Princeton University                 7
9               10                     Cornell University                19

In [66]:
ttest_rel(tmp3.times_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=2.075005503735246, pvalue=0.0678118582876486)

# cwur에서 상위 10위가 shanghai에서는?

+ 유의한 차이 없음

### Year 2012

In [67]:
cwur2012_top10 = cwur[cwur['year'] == 2012].head(10)
cwur2012_top10


tmp1 = cwur2012_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})
tmp2 = shanghai[shanghai['year']==2012][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                     university_name  shanghai_world_rank
0                1                  Harvard University                    1
1                3                 Stanford University                    2
2                4             University of Cambridge                    5
3                5  California Institute of Technology                    6
4                6                Princeton University                    7
5                7                University of Oxford                   10
6                8                     Yale University                   11
7                9                 Columbia University                    8
8               10  University of California, Berkeley                    4

In [68]:
ttest_rel(tmp3.shanghai_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=0.12285902336679022, pvalue=0.9052491586197566)

### Year 2013

In [69]:
cwur2013_top10 = cwur[cwur['year'] == 2013].head(10)
cwur2013_top10


tmp1 = cwur2013_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})
tmp2 = shanghai[shanghai['year']==2013][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                     university_name  shanghai_world_rank
0                1                  Harvard University                    1
1                2                 Stanford University                    2
2                3                University of Oxford                   10
3                5             University of Cambridge                    5
4                6                 Columbia University                    8
5                7  University of California, Berkeley                    3
6                8                Princeton University                    7
7                9               University of Chicago                    9
8               10                     Yale University                   11

In [70]:
ttest_rel(tmp3.shanghai_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=0.5707301455353496, pvalue=0.5838535610860944)

### Year 2014

In [71]:
cwur2013_top10 = cwur[cwur['year'] == 2013].head(10)
cwur2013_top10


tmp1 = cwur2013_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})
tmp2 = shanghai[shanghai['year']==2013][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                     university_name  shanghai_world_rank
0                1                  Harvard University                    1
1                2                 Stanford University                    2
2                3                University of Oxford                   10
3                5             University of Cambridge                    5
4                6                 Columbia University                    8
5                7  University of California, Berkeley                    3
6                8                Princeton University                    7
7                9               University of Chicago                    9
8               10                     Yale University                   11

In [72]:
ttest_rel(tmp3.shanghai_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=0.5707301455353496, pvalue=0.5838535610860944)

### Year 2015

In [73]:
cwur2015_top10 = cwur[cwur['year'] == 2015].head(10)
cwur2015_top10


tmp1 = cwur2015_top10[["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})
tmp2 = shanghai[shanghai['year']==2015][["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})


tmp3 = pd.merge(tmp1,tmp2)
tmp3

   cwur_world_rank                     university_name  shanghai_world_rank
0                1                  Harvard University                    1
1                2                 Stanford University                    2
2                4             University of Cambridge                    5
3                5                University of Oxford                   10
4                6                 Columbia University                    8
5                7  University of California, Berkeley                    4
6                8               University of Chicago                    9
7                9                Princeton University                    6
8               10                  Cornell University                   13

In [74]:
ttest_rel(tmp3.shanghai_world_rank, tmp3.cwur_world_rank)

Ttest_relResult(statistic=0.769800358919501, pvalue=0.4635402169203734)

# shanghai에서 상위 10위가 times에서는?

### Year2012

In [76]:
shanghai2012_top10 = shanghai[shanghai['year'] == 2012].head(10)

tmp1 = shanghai2012_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = times[times['year']==2012][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  times_world_rank
0                    1                  Harvard University                 2
1                    2                 Stanford University                 2
2                    4  University of California, Berkeley                10
3                    5             University of Cambridge                 6
4                    6  California Institute of Technology                 1
5                    7                Princeton University                 5
6                    8                 Columbia University                12
7                    9               University of Chicago                 9
8                   10                University of Oxford                 4

In [77]:
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=-0.08646754023342337, pvalue=0.9332197776918166)

### Year2013

In [78]:
shanghai2013_top10 = shanghai[shanghai['year'] == 2013].head(10)

tmp1 = shanghai2013_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = times[times['year']==2013][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  times_world_rank
0                    1                  Harvard University                 4
1                    2                 Stanford University                 2
2                    3  University of California, Berkeley                 9
3                    5             University of Cambridge                 7
4                    6  California Institute of Technology                 1
5                    7                Princeton University                 6
6                    8                 Columbia University                14
7                    9               University of Chicago                10
8                   10                University of Oxford                 2

In [79]:
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=0.2857142857142857, pvalue=0.782355278822183)

### Year2014

In [81]:
shanghai2014_top10 = shanghai[shanghai['year'] == 2014].head(10)

tmp1 = shanghai2014_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = times[times['year']==2014][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  times_world_rank
0                    1                  Harvard University                 2
1                    2                 Stanford University                 4
2                    5             University of Cambridge                 7
3                    6                Princeton University                 6
4                    7  California Institute of Technology                 1
5                    8                 Columbia University                13
6                    9               University of Chicago                 9
7                    9                University of Oxford                 2

In [82]:
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=-0.2584725505444276, pvalue=0.8034773779387544)

### Year2015

In [83]:
shanghai2015_top10 = shanghai[shanghai['year'] == 2015].head(10)

tmp1 = shanghai2015_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = times[times['year']==2015][["world_rank","university_name"]].rename(columns={"world_rank":"times_world_rank"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  times_world_rank
0                    1                  Harvard University                 2
1                    2                 Stanford University                 4
2                    4  University of California, Berkeley                 8
3                    5             University of Cambridge                 5
4                    6                Princeton University                 7
5                    7  California Institute of Technology                 1
6                    8                 Columbia University                14
7                    9               University of Chicago                11
8                   10                University of Oxford                 3

In [84]:
ttest_rel(tmp3.times_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=0.23408229439226114, pvalue=0.8208003996247182)

# shanghai에서 상위 10위가 cwur에서는?

### Year 2012

In [96]:
shanghai2012_top10 = shanghai[shanghai['year'] == 2012].head(10)

tmp1 = shanghai2012_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = cwur[cwur['year']==2012][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  cwur_world_rank
0                    1                  Harvard University                1
1                    2                 Stanford University                3
2                    4  University of California, Berkeley               10
3                    5             University of Cambridge                4
4                    6  California Institute of Technology                5
5                    7                Princeton University                6
6                    8                 Columbia University                9
7                    9               University of Chicago               11
8                   10                University of Oxford                7

In [97]:
ttest_rel(tmp3.cwur_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=0.5218624584427538, pvalue=0.6159027828310646)

### Year 2013

In [90]:
shanghai2013_top10 = shanghai[shanghai['year'] == 2013].head(10)

tmp1 = shanghai2013_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = cwur[cwur['year']==2013][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  cwur_world_rank
0                    1                  Harvard University                1
1                    2                 Stanford University                2
2                    3  University of California, Berkeley                7
3                    5             University of Cambridge                5
4                    6  California Institute of Technology               11
5                    7                Princeton University                8
6                    8                 Columbia University                6
7                    9               University of Chicago                9
8                   10                University of Oxford                3

In [91]:
ttest_rel(tmp3.cwur_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=0.09678678369916546, pvalue=0.925276515262485)

### Year 2014

In [92]:
shanghai2014_top10 = shanghai[shanghai['year'] == 2014].head(10)

tmp1 = shanghai2014_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = cwur[cwur['year']==2014][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  cwur_world_rank
0                    1                  Harvard University                1
1                    2                 Stanford University                2
2                    5             University of Cambridge                4
3                    6                Princeton University                9
4                    7  California Institute of Technology               12
5                    8                 Columbia University                6
6                    9               University of Chicago                8
7                    9                University of Oxford                5

In [93]:
ttest_rel(tmp3.cwur_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=0.0, pvalue=1.0)

### Year 2015

In [94]:
shanghai2015_top10 = shanghai[shanghai['year'] == 2015].head(10)

tmp1 = shanghai2015_top10[["world_rank","university_name"]].rename(columns={"world_rank":"shanghai_world_rank"})
tmp2 = cwur[cwur['year']==2015][["world_rank","institution"]].rename(columns={"world_rank":"cwur_world_rank",
  "institution":"university_name"})

tmp3 = pd.merge(tmp1,tmp2)
tmp3

   shanghai_world_rank                     university_name  cwur_world_rank
0                    1                  Harvard University                1
1                    2                 Stanford University                2
2                    4  University of California, Berkeley                7
3                    5             University of Cambridge                4
4                    6                Princeton University                9
5                    7  California Institute of Technology               12
6                    8                 Columbia University                6
7                    9               University of Chicago                8
8                   10                University of Oxford                5

In [95]:
ttest_rel(tmp3.cwur_world_rank, tmp3.shanghai_world_rank)

Ttest_relResult(statistic=0.2198598839717251, pvalue=0.8314867146342761)

# result

+ paired t-test 결과 상위 10위까지는 크게 순위가 다르지 않음을 알 수 있다.
+ 추가로 전체 겹치는 대학들 순위의 차이를 보는것도 좋을 것같음
+ 년도별로 말고 대학별로 순위를 평균내서 비교 해보는 것도 좋을 것 같음